import useTitle from "@/Hooks/useTitle";
import RoleBreadcrumb from "./RoleBreadcrumb";
import { BiSolidLeftArrow } from "react-icons/bi";
import { Chip, Divider } from "@nextui-org/react";
const items = [
  {
    id: 1,
    text: "توجه داشته باشید که در صورت نداشتن فیش واریزی برای اداره پست ، امکان عودت هزینه ارسال وجود ندارد.",
  },
  {
    id: 2,
    text: "هنگام مرجوع محصول ارسال فاکتور و لیبل متصل به محصول  الزامی است.",
  },
  {
    id: 3,
    text: "توجه داشته باشید برای مرجوعی به هیچ عنوان لیبل را از کار جدا نکنید و کمتر از 7 روز از زمانی که محصول به دست شما می رسد برای مرجوعی اقدام کنید چنانچه لیبل جدا شود و یا بیش از زمان معین شده اقدام شود از پذیرش مرجوعی شما معذور هستیم.",
  },
];
const Role = () => {
  const title = useTitle("قوانین و مقررات");
  return (
    <>
      <RoleBreadcrumb />

      <section className="space-y-6">
      <h1>قوانین و مقررات</h1>
      <h2>شرایط مرجوعی و قوانین</h2>
      <Chip color="danger">شرایط مرجوع کالا در فروشگاه ایواز</Chip>
      <p>
        کاربر می‌تواند کالای ثبت شده را در صورتی که کار مورد پسند نباشد، از لحاظ
        سایز مناسب نباشد و .... مرجوع کند. که در این صورت هزینه پست بر عهده خود
        کاربر است.
      </p>
      <p>
        در صورتی که کالا دارای ایراد باشد یا با اطلاعات درج شده در سایت مطابقت
        نداشته باشد، در صورت تایید پشتیبانی هزینه پست بر عهده فروشگاه ایواز است.
      </p>
      <ul className="space-y-6">
        {items.map(({ id, text }) => (
          <li key={id} className="flex items-center gap-1 text-justify leading-9">
            <BiSolidLeftArrow className="size-4 shrink-0 fill-orange-500" />
            {text}
          </li>
        ))}
      </ul>
      <p>
        بازگشت کالا صرفا با تایید تیم پشتیبانی امکان پذیر خواهد بود . در صورتی
        که بدون هماهنگی و تایید فرم مرجوعی محصولی برگشت زده شود، هزینه و تبعات
        آن بر عهده کاربر خواهد بود.
      </p>
      <p>
        در صورتی که ایراد اعلام شده از سمت کاربر پس از رسیدن بسته به تیم ما قابل
        رویت نباشد، مجموعه ایواز هیچ مسئولیتی در قبال هزینه پست نخواهد داشت.
      </p>
      <div>
        <Chip color="danger" className="ml-1">توجه</Chip>
        داشته باشید مهم ترین شرط برای بازگشت کالا، سالم و تمیز بودن محصول و عدم
        وجود بوی نامطبوع یا عطر است.
      </div>
      <p className="flex-center my-3 font-extrabold text-xl">
        کالاهایی مانند بادی به علت مسائل بهداشتی امکان مرجوع ندارند
      </p>
      <p>
        برای مرجوعی محصول، ابتدا فرم حساب بانکی را باید پر کنید و منتظر تایید از
        طرف تیم پشتیبانی باشید. در نظر داشته باشید که در این مرحله برای شما
        پیامکی ارسال نخواهد شد و برای اطلاع از تایید یا عدم تایید حساب بانکی
        باید فرم حساب بانکی خود را چک کنید .
      </p>
      <p>
        پس از تایید حساب بانکی ، فرم درخواست مرجوعی خود را در لیست سفارشات پر
        کنید. فرم مرجوعی شما تا 24 ساعت پس از ثبت ، توسط تیم پشتیبانی ما بررسی
        می‌شود و نتیجه نهایی در قالب پیامک برای شما ارسال خواهد شد.{" "}
      </p>
      <p className="flex-center my-3 font-extrabold text-xl">
        در صورت تایید می توانید مرجوعی خود را ارسال کنی
      </p>
      <Divider />
      <Chip color="danger">مسئولیت صحت آدرس و اطلاعات بر عهده کاربر است</Chip>
      <p>
        لطفا آدرس و اطلاعات را بصورت کامل وارد کنید و در صورت ناقص بودن آدرس و
        اطلاعات ، بسته شما از سمت اداره پست به ما برگشت خورده و هزینه ارسال مجدد
        بر عهده کاربر است .
      </p>
      <p>
        نهایت زمان انجام تغییرات ( تعویض ، کنسل ، اضافه کردن محصول به سفارش و
        تغییر آدرس ) 5 ساعت است .
      </p>
      <div>
        <Chip color="danger" className="ml-1">نکته:</Chip>
          چنانچه در زمان غیر کاری ما، سفارش انجام شود فقط در ساعات 8 الی 10 صبح
          روز بعد امکان تغییرات وجود دارد.
      </div>
      <p>
        در ایام جشنواره و فروش فوق العاده امکان هرگونه تغییرات در سفارش و همچنین
        مرجوع محصول تخفیفی وجود ندارد.
      </p>
      </section>
    </>
  );
};

export default Role;
